Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: Define `SomeIndexedEntity` as an entity type for Hibernate Search.
ja_jp: Hibernate Search のエンティティータイプとして `SomeIndexedEntity` を定義します。

source: Define a `BuildStep` that produces a `MetricsFactoryConsumerBuildItem` that uses a `RUNTIME_INIT` or `STATIC_INIT` Recorder to define a `MetricsFactory` consumer. For example, the following creates a `MetricsFactoryConsumerBuildItem` if and only if metrics are enabled both for Agroal generally, and for a datasource specifically:
ja_jp: `RUNTIME_INIT` または `STATIC_INIT` レコーダーを使用して `MetricsFactory` コンシューマーを定義して `MetricsFactoryConsumerBuildItem` を生成する `BuildStep` を定義します。たとえば以下は、メトリクスが一般的に Agroal とデータソースの両方で有効になっている場合にのみ `MetricsFactoryConsumerBuildItem` を作成します。

source: Define a custom base unit. See link:{base-units}[BaseUnits.java] for predefined values.
ja_jp: カスタムベースユニットを定義します。事前定義された値については link:{base-units}[BaseUnits.java] を参照してください。

source: Define a datasource named `inventory`.
ja_jp: `inventory` という名前のデータソースを定義します。

source: Define a datasource named `users`.
ja_jp: `users` という名前のデータソースを定義します。

source: Define a datasource with the following configuration property, where `db-kind` defines which database platform to connect to, for example, `h2`:
ja_jp: 以下の設定プロパティーでデータソースを定義します。 `db-kind` は、どのデータベースプラットフォームに接続するかを定義します。例えば、 `h2` の場合:

source: Define a full-text search field for the `text` property.
ja_jp: `text` プロパティーのフルテキスト検索フィールドを定義します。

source: Define a job to be executed at a fixed interval of time `fixedRate.expr` which is configurable in `application.properties`.
ja_jp: 一定の時間間隔で実行されるジョブを定義します。 `application.properties` 内で `fixedRate.expr` で設定可能です。

source: Define a job with a cron-like expression `cron.expr` which is configurable in `application.properties`.
ja_jp: `application.properties` で設定可能な`cron.expr` で cron のような式でジョブを定義します。

source: Define a job with a cron-like expression. The annotated method is executed at 10:15am every day.
ja_jp: cron のような式でジョブを定義します。アノテーションされたメソッドは毎日午前 10 時 15 分に実行されます。

source: Define a method to be executed at a fixed interval of time. The period is expressed in milliseconds.
ja_jp: 一定の時間間隔で実行されるメソッドを定義します。期間はミリ秒単位で指定します。

source: Define a named proxy configuration `baby-proxy` without username and password.
ja_jp: ユーザー名とパスワードなしで、名前付きプロキシー設定 `baby-proxy` を定義します。

source: Define a persistence unit called `inventory` pointing to the `inventory` datasource.
ja_jp: `inventory` データソースを指す `inventory` という名前の永続化ユニットを定義します。

source: Define a persistence unit called `users` pointing to the `users` datasource.
ja_jp: `users` データソースを指す `users` という名前の永続化ユニットを定義します。

source: Define a persistence unit called `users`.
ja_jp: `users` という永続化ユニットを定義します。

source: Define a persistence unit named `inventory` and specify the datasource.
ja_jp: `inventory` という名前の永続化ユニットを定義し、データソースを指定します。

source: Define a persistence unit named `users` and specify the datasource.
ja_jp: `users` という名前の永続化ユニットを定義し、データソースを指定します。

source: Define a reactive datasource named `inventory`.
ja_jp: `inventory` という名前の Reactive データソースを定義します。

source: Define a reactive datasource named `users`.
ja_jp: `users` という名前の Reactive データソースを定義します。

source: Define a second business method to do this:
ja_jp: そのために、二番目のビジネスメソッドを次のように定義します:

source: Define a volume to mount the ConfigMap and reference the ConfigMap that receives the CA certificate.
ja_jp: ConfigMap をマウントし、CA 証明書を受け取る ConfigMap を参照するためのボリュームを定義します。

source: Define a volume to mount the secret. Use the same name as the secret declared above.
ja_jp: シークレットをマウントするボリュームを定義します。 上記で宣言したシークレットと同じ名前を使用します。

source: Define dimensions for aggregation
ja_jp: 集計のディメンションを定義する

source: Define fault-tolerant services
ja_jp: フォールトトレラントなサービスを定義する

source: Define health endpoints
ja_jp: ヘルスエンドポイントの定義

source: Define list that will hold arbitrary numbers.
ja_jp: 任意の数値を保持するリストを定義します。

source: Define or update the `/enhanced-config` path in the default tenant configuration.
ja_jp: デフォルトのテナント設定で `/enhanced-config` パスを定義または更新します。

source: Define the Entity
ja_jp: エンティティの定義

source: Define the `SomeIndexedEntity` entity as indexed.
ja_jp: `SomeIndexedEntity` エンティティーをインデックスが作成されたと定義します。

source: Define the `quarkus` packaging that comes with a lifecycle tailored for Quarkus applications. Do not use in library modules, only in the main application module.
ja_jp: Quarkus アプリケーション向けに調整されたライフサイクルを持つ `quarkus` パッケージングを定義します。ライブラリーモジュールでは使用せず、メインアプリケーションモジュールでのみ使用してください。

source: Define the artifact id (Maven or Gradle)
ja_jp: アーティファクトIDの定義 (MavenまたはGradle)

source: Define the base unit, see link:{base-units}[BaseUnits.java] for predefined values.
ja_jp: 基本単位を定義します。事前定義された値については link:{base-units}[BaseUnits.java] を参照してください。

source: Define the class in your runtime module that will contain methods that make data available in the UI
ja_jp: ランタイム・モジュールの中に、UIでデータを利用可能にするメソッドを含むクラスを定義する。

source: Define the class in your runtime or runtime-dev module that will contain methods that make data available in the UI
ja_jp: UI でデータを利用可能にするメソッドを含むクラスを、runtime または runtime-dev モジュールで定義します。

source: Define the configuration to run the database
ja_jp: データベースを実行するための設定を定義

source: Define the constraints and calculate the score
ja_jp: 制約の定義とスコアの計算

source: Define the datasource used by the persistence unit.
ja_jp: 永続化ユニットが使用するデータソースを定義します。

source: Define the document id property.
ja_jp: ドキュメント ID プロパティーを定義します。

source: Define the document title following guidance in <<titles-headings>>.
ja_jp: ドキュメントのタイトルを <<titles-headings>> ガイダンスに従って定義します。

source: Define the document title following guidance in xref:titles-headings[Titles and headings].
ja_jp: xref:titles-headings[タイトルと見出し] のガイダンスに従って、ドキュメントのタイトルを定義してください。

source: Define the first step
ja_jp: 最初の手順の定義

source: Define the interfaces for generation as explained in <<hr-generating-resources, the resource generation section>>.
ja_jp: <<hr-generating-resources, リソースの生成のセクション>>で説明したように、生成のためのインターフェイスを定義する。

source: Define the interfaces for generation as explained in the <<hr-generating-resources,resource generation>> section.
ja_jp: xref:hr-generating-resources[リソース生成] のセクションで説明したように、生成のためのインターフェイスを定義します。

source: Define the interfaces for generation as explained in the <<hr-generating-resources>> section.
ja_jp: <<hr-generating-resources>> のセクションで説明したように、生成のためのインターフェイスを定義します。

source: Define the interfaces for generation as explained in the resource generation section.
ja_jp: リソース生成の項で説明したように、生成用のインターフェースを定義します。

source: Define the interfaces for generation as explained in the xref:hr-generating-resources[Generating resources] section.
ja_jp: xref:hr-generating-resources[リソース生成] のセクションで説明したように、生成のためのインターフェイスを定義します。

source: Define the interfaces for generation as explained in the xref:hr-generating-resources[resource generation] section.
ja_jp: xref:hr-generating-resources[リソース生成] の項で説明したように、生成のためのインターフェイスを定義する。

source: Define the latest version of the extension in your POM file.
ja_jp: POM ファイルでエクステンションの最新バージョンを定義します。

source: Define the logger field.
ja_jp: ロガーフィールドを定義します。

source: Define the maven/gradle artifact id
ja_jp: maven/gradle アーティファクト ID を定義します。

source: Define the nginx load balancer to route incoming traffic to an appropriate node
ja_jp: 受信トラフィックを適切なノードにルーティングするための nginx ロードバランサーを定義

source: Define the repository
ja_jp: リポジトリの定義

source: Define the tasks service
ja_jp: タスクサービスの定義

source: Define the user entity
ja_jp: ユーザーエンティティーの定義

source: Define this property in your `pom.xml`: `<m2e.apt.activation>jdt_apt</m2e.apt.activation>`, although if you rely on `io.quarkus:quarkus-build-parent` you will get it for free.
ja_jp: `pom.xml`: `<m2e.apt.activation>jdt_apt</m2e.apt.activation>` でこのプロパティーを定義します。 `io.quarkus:quarkus-build-parent` に依存している場合は、無料で入手できます。

source: Define whatever token you want, it will not be validated by the OAuth2 mock authorization server.
ja_jp: 任意のトークンを定義してください。OAuth2のモック認可サーバーでは検証されません。

source: Define your dependency injection with Spring DI
ja_jp: Spring DI で依存性注入を定義する

source: Define your persistent model in Hibernate ORM with Panache
ja_jp: Panache を使用して Hibernate ORM に永続モデルを定義

source: Define your persistent model with Hibernate ORM and JPA
ja_jp: Hibernate ORM および JPA を使用して永続モデルを定義

source: Defines a fragment with identifier `item_aliases`. Note that only alphanumeric characters and underscores can be used in the identifier.
ja_jp: 識別子 `item_aliases` を持つフラグメントを定義します。識別子には、英数字とアンダースコアしか使用できないことに注意してください。

source: Defines a fragment with identifier `item_aliases`. Note that only alphanumeric characters and underscores can be used in the identifier. The name of the first parameter can be omitted - `{#fragment item_aliases}` is fine too.
ja_jp: 識別子 `item_aliases` を持つフラグメントを定義します。識別子には英数字とアンダースコアしか使えないことに注意してください。最初のパラメータ名は省略可能で、 `{#fragment item_aliases}` でもかまいません。

source: Defines a fragment with identifier `item`.
ja_jp: 識別子 `item` を持つフラグメントを定義します

source: Defines a hidden fragment with identifier `strong`. In this particular case, we use the `false` boolean literal as the value of the `rendered` parameter. However, it's possible to use any expression there.
ja_jp: 識別子 `strong` を持つ隠しフラグメントを定義します。 この特定のケースでは、 `rendered` パラメーターの値として `false` ブール値リテラルを使用します。 ただし、任意の式を使用することも可能です。

source: Defines a hidden fragment with identifier `strong`. `{#capture strong}` can be replaced with `{#fragment strong rendered=false}` or `{#fragment strong _hidden}`. The `rendered` parameter can use any expression, e.g. `{#fragment strong rendered=config.isRendered}`.
ja_jp: 識別子 `strong` を持つ非表示フラグメントを定義します。 `{#capture strong}` は `{#fragment strong rendered=false}` または `{#fragment strong _hidden}` に置き換えることができます。 `rendered` パラメータには任意の式を使用できます (例: `{#fragment strong rendered=config.isRendered}`)。

source: Defines a policy where only authenticated users can access resources from your application.
ja_jp: 認証されたユーザーのみがアプリケーションのリソースにアクセスできるようにするポリシーを定義します。

source: Defines a policy where only authenticated users should have access to resources from your application.
ja_jp: 認証されたユーザーのみがアプリケーションからリソースにアクセスできるようにするポリシーを定義します。

source: Defines that the server should *always* ask certificates from clients. You can relax this behavior by using `REQUEST` so that the server should still accept requests without a certificate. Useful when you are also supporting authentication methods other than mTLS.
ja_jp: サーバーが *常に*クライアントからの証明書を要求することを定義します。 `REQUEST` を使用することで、この動作を緩和することができます。mTLS 以外の認証方法もサポートしている場合に便利です。

source: Defines the `groups` claim, which provides the group memberships and top-level roles assigned to the JWT bearer.
ja_jp: JWT ベアラーに割り当てられたグループメンバーシップと最上位レベルのロールを提供する `groups` クレームを定義します。

source: Defines the `name` property for the custom resource with a possibility for a later edit. For example:
ja_jp: 後で編集できるように、カスタムリソースの `name` プロパティーを定義します。以下に例を示します。

source: Defines the client secret for authentication with the Keycloak server.
ja_jp: Keycloak サーバーによる認証用のクライアントシークレットを定義します。

source: Defines the contents for the type-safe template represented by the `Hello` record. The derived template id is `HelloResource/Hello`.
ja_jp: `Hello` レコードによって表される型セーフテンプレートの内容を定義します。派生テンプレート ID は `HelloResource/Hello` です。

source: Defines the default role requirements for unannotated endpoints. The `**` role is a special role that means any authenticated user. This cannot be combined with `deny-unannotated-endpoints` because `deny` takes effect instead.
ja_jp: アノテーションのないエンドポイントのデフォルトのロール要件を定義します。 `**` ロールは、認証されたすべてのユーザーを意味する特別なロールです。 代わりに `deny` が有効になるため、これを `deny-unannotated-endpoints` と組み合わせることはできません。

source: Defines the default role requirements for unannotated endpoints. The role '**' is a special role that means any authenticated user. This cannot be combined with `deny-unannotated-endpoints`, as the deny will take effect instead.
ja_jp: アノテーションされていないエンドポイントのデフォルトのロール要件を定義します。ロール「**」は、認証された任意のユーザを意味する特別なロールです。これは、代わりにdenyが有効になるため、 `deny-unannotated-endpoints` と組み合わせることはできません。

source: Defines the exception type you want to handle
ja_jp: 処理する例外型を定義します

source: Defines the expected issuer as `https://example.com/issuer`.
ja_jp: 発行者を `https://example.com/issuer` として定義します。

source: Defines the interception type.
ja_jp: インターセプトの種類を定義します。

source: Defines the local variable that can be used inside the parent `{#if}` section.
ja_jp: 親 `{#if}` セクション内で使用できるローカル変数を定義します。

source: Defining Bindings
ja_jp: バインディングの定義

source: Defining Exchanges
ja_jp: エクスチェンジの定義

source: Defining Queues
ja_jp: キューの定義

source: Defining STM-aware classes
ja_jp: STM を意識したクラスの定義

source: Defining a Docker registry
ja_jp: Docker レジストリーの定義

source: Defining and executing business rules with Drools
ja_jp: Drools によるビジネスルールの定義と実行

source: Defining bindings
ja_jp: バインディングの定義

source: Defining entities in external projects or jars
ja_jp: 外部プロジェクトや jar でエンティティーを定義する

source: Defining exchanges
ja_jp: エクスチェンジの定義

source: Defining multiple datasources works exactly the same way as defining a single datasource, with one important change: you define a name.
ja_jp: 複数のデータソースの定義は、単一のデータソースの定義と全く同じです。ただし、1 つだけ重要な変更点があります。それは、名前を定義することです。

source: Defining multiple datasources works like defining a single datasource, with one important change - you have to specify a name (configuration property) for each datasource.
ja_jp: 複数のデータソースの定義は、単一のデータソースを定義するのと同じように機能しますが、重要な変更点が 1 つあります。それは、各データソースの名前 (設定プロパティー) を指定する必要があることです。

source: Defining our user entity
ja_jp: ユーザーエンティティーの定義

source: Defining queues
ja_jp: キューの定義

source: Defining the analyzers used
ja_jp: 使用するアナライザーの定義

source: Defining the response
ja_jp: レスポンスの定義

source: Defining the response.
ja_jp: レスポンスの定義

source: Defining transaction boundaries
ja_jp: トランザクションの境界の定義

source: Defining virtual hosts
ja_jp: 仮想ホストの定義

source: Defining your entity
ja_jp: エンティティの定義

source: Defining your repository
ja_jp: リポジトリの定義

source: Definitely worth a watch if you want to learn about Quarkus and how it is developed.
ja_jp: Quarkusとその開発方法について知りたい方は、ぜひご覧になってみてください。

source: Delay class initialization
ja_jp: 遅延クラス初期化

source: Delay this policy's permission check after the endpoint-specific authentication mechanism has been selected.
ja_jp: エンドポイント固有の認証メカニズムの選択後、このポリシーの権限チェックを遅らせます。

source: Delay to wait before redelivering messages that failed to be processed. + When an application uses `Consumer#negativeAcknowledge(Message)`, failed messages are redelivered after a fixed timeout.
ja_jp: 処理に失敗したメッセージを再配信するまでの待ち時間。 アプリケーションが `Consumer#negativeAcknowledge(Message)` を使用する場合、処理に失敗したメッセージは一定のタイムアウト後に再配信されます。

source: Delayed Execution
ja_jp: 遅延実行

source: Delayed Start of a Trigger
ja_jp: トリガーの遅延開始

source: Delaying class initialization
ja_jp: クラスの初期化を遅らせる

source: Delaying the readiness of your application: you need to wait a couple of seconds before actually serving a business request.
ja_jp: アプリケーションの準備が遅れる: 実際にビジネスリクエストに対応する前に数秒待つ必要があります。

source: Delegate to the UI live coding server. https://quarkiverse.github.io/quarkiverse-docs/quarkus-quinoa/dev/#dev-server[You configure the port of the UI server]. By convention Quinoa will call the `start` script from the package.json to start the UI server process. Then it will transparently proxy relevant requests to the given port.
ja_jp: UIライブコーディングサーバーに委譲。 link:https://quarkiverse.github.io/quarkiverse-docs/quarkus-quinoa/dev/#dev-server[UIサーバーのポートを設定] します。慣習として、Quinoa は UI サーバープロセスを開始するために package.json から `start` スクリプトを呼び出します。その後、指定されたポートに関連するリクエストを透過的にプロキシします。

source: Delegates all class loading to the JDK's class loaders (required for AOT to work effectively as Leyden currently does not support custom class loaders)
ja_jp: すべてのクラスロードを JDK のクラスローダーに委譲する (Leyden が現在カスタムクラスローダーをサポートしていないため、AOT を効果的に機能させるために必要です)

source: Delete a key (and its associated value)
ja_jp: キー（とそれに付随する値）を削除します

source: Delete an existing resource, link:{httpspec}#section-4.2.2[idempotent] (link:{httpspec}#section-4.3.5[HTTP docs])
ja_jp: 既存のリソースを削除します。link:{httpspec}#section-4.2.2[idempotent] (link:{httpspec}#section-4.3.5[HTTP docs])

source: Delete the `first` increment.
ja_jp: `first` のインクリメントを削除します。

source: Delete the stored CA certificate and replace `$Serial_Number` with the serial number of the CA certificate:
ja_jp: 保存されている CA 証明書を削除します。`$Serial_Number` を CA 証明書のシリアル番号に置き換えます。

source: Deleting a key
ja_jp: キーの削除

source: Deleting the CA certificate on Linux
ja_jp: Linux での CA 証明書の削除

source: Deleting the CA certificate on Mac
ja_jp: Mac での CA 証明書の削除

source: Deleting the CA certificate on Windows
ja_jp: Windows での CA 証明書の削除

source: Demo 1 - Hello, World!
ja_jp: デモ1 - Hello, World!

source: Demo 2 - Developer tooling & productivity
ja_jp: デモ2 - デベロッパーツールと生産性

source: Demo 3 - JVM & Native performance stats
ja_jp: デモ3 - JVMとNativeのパフォーマンス統計

source: Denotes a message bundle interface. The bundle name is defaulted to `msg` and is used as a namespace in templates expressions, e.g. `{msg:hello_name}`.
ja_jp: メッセージバンドルインターフェイスを表します。 バンドル名のデフォルトは `msg` で、テンプレート式の名前空間として使用されます (例: `{msg:hello_name}`)。

source: Depend on a `BeanArchiveIndexBuildItem` to have the build step be run after the deployment has been indexed.
ja_jp: `BeanArchiveIndexBuildItem` に依存して、デプロイメントのインデックスが作成された後にビルドステップを実行します。

source: Depend only on the modules you need
ja_jp: 必要なモジュールのみに依存

source: Dependencies
ja_jp: 依存関係

source: Dependency
ja_jp: 依存関係

source: Dependency Injection
ja_jp: 依存性注入

source: Dependency Management
ja_jp: 依存関係管理

source: Dependency SBOMs
ja_jp: 依存関係 SBOM

source: Dependency changes and setting a minimum Quarkus version
ja_jp: 依存関係の変更と最小 Quarkus バージョンの設定

source: Dependency injection and lookup
ja_jp: 依存関係の注入とルックアップ

source: Dependency injection in Quarkus is based on ArC which is a CDI-based dependency injection solution tailored for Quarkus' architecture. If you're new to CDI then we recommend you to read the xref:cdi.adoc[Introduction to CDI] guide.
ja_jp: Quarkus の依存性注入は、Quarkus のアーキテクチャに合わせて調整された CDI ベースの依存性注入ソリューションである ArC をベースにしています。 CDI が初めての方は、 xref:cdi.adoc[CDI入門] ガイドをお読みになることをお勧めします。

source: Dependency injection in Quarkus is based on ArC which is a CDI-based dependency injection solution tailored for Quarkus' architecture. You can learn more about it in the xref:cdi-reference.adoc[Contexts and Dependency Injection guide].
ja_jp: Quarkus の依存性注入は、Quarkus のアーキテクチャーに合わせて調整された CDI ベースの依存性注入ソリューションである ArC をベースにしています。 ArC の詳細については、link:cdi-reference[コンテキストと依存性注入ガイド] を参照してください。

source: Dependency jars are stored unmodified as individual files in the `quarkus-app/lib/` directory. All other files in the `quarkus-app/` directory are generated. The `quarkusAppPartsBuild` task builds `fast-jar` package-type applications and allows caching of the _generated_ pieces, which is everything except the dependencies in the `quarkus-app/lib/` directory. The `quarkusDependenciesBuild` task is used to collect the dependencies via Gradle mechanisms. The `quarkusBuild` task then assembles the outputs of the `quarkusAppPartsBuild` and `quarkusDependenciesBuild` tasks. Note: `fast-jar` (or `-jar`) is the default if no package type has been explicitly configured.
ja_jp: 依存関係 jar は、 `quarkus-app/lib/` ディレクトリーに個別のファイルとして、そのまま保存されます。 `quarkusAppPartsBuild` タスクは、 `fast-jar` パッケージタイプのアプリケーションをビルドします。これにより、_generated_ ピースのキャッシュが可能になります。 `quarkus-app/lib/` ディレクトリー内の依存関係を除くすべての _生成された_ ピースのキャッシュが可能になります。 `quarkusDependenciesBuild` タスクは、Gradle メカニズムを介して依存関係を収集するために使用されます。 その後、 `quarkusBuild` タスクは `quarkusAppPartsBuild` タスクと `quarkusDependenciesBuild` タスクの出力をアセンブルします。 注記: パッケージタイプが明示的に設定されていない場合は、 `fast-jar` (または `-jar`) がデフォルトになります。

source: Dependency resolver options
ja_jp: 依存関係リゾルバーオプション

source: Dependent beans injected into the fields and test method arguments are correctly destroyed before a test instance is destroyed and after the test method completes, respectively.
ja_jp: フィールドに注入された依存 Bean とテストメソッド引数は、それぞれテストインスタンスが破棄される前とテストメソッドが完了した後に正しく破棄されます。

source: Depending on the API module
ja_jp: API モジュールへの依存

source: Depending on the API you use, the MDC class is slightly different. However, the APIs are very similar:
ja_jp: 使用するAPIによって、MDCクラスは若干異なります。しかし、APIは非常によく似ています：

source: Depending on the JAX-RS method that returns this user, we might want to exclude the `id` field from serialization - for example you might want an insecure method to not expose this field. The way we can achieve that in RESTEasy Reactive is shown in the following example:
ja_jp: このユーザーを返す JAX-RS メソッドによっては、シリアル化から `id` フィールドを除外したい場合があります。たとえば、安全でないメソッドでこのフィールドを公開しないようにしたい場合があります。RESTEasy Reactive でそれを実現する方法を、次の例に示します。

source: Depending on the Jakarta REST method that returns this user, we might want to exclude the `id` field from serialization. For example, you might want an insecure method to not expose this field. The way we can achieve that in Quarkus REST is shown in the following example:
ja_jp: このユーザーを返す Jakarta REST メソッドによっては、 `id` フィールドをシリアライズから除外したい場合があります。たとえば、安全でないメソッドでは、このフィールドを公開しないようにする場合があります。Quarkus REST で実現する方法は、次の例のとおりです。

source: Depending on the Jakarta REST method that returns this user, we might want to exclude the `id` field from serialization. For example, you might want an insecure method to not expose this field. The way we can achieve that in RESTEasy Reactive is shown in the following example:
ja_jp: このユーザーを返す Jakarta REST メソッドによっては、 `id` フィールドをシリアライズから除外したい場合があります。例えば、安全でないメソッドでは、このフィールドを公開しないようにしたい場合があります。RESTEasy Reactiveでそれを実現する方法は、次の例のとおりです:

source: Depending on the connector, payload types available to consume in processing methods differ. You can implement a custom `MessageConverter` to transform the payload to a type that is accepted by your application.
ja_jp: コネクターに応じて、処理方法で使用できるペイロードタイプが異なります。 カスタム `MessageConverter` を実装して、ペイロードをアプリケーションで受け入れられる型に変換できます。

source: Depending on what the final desired output of the CI/CD pipeline is, the generated binary might then be used to create a container image.
ja_jp: CI/CD パイプラインの最終的な出力に応じて、生成されたバイナリーがコンテナーイメージの作成に使用されます。

source: Depending on what your action does with the content input, your output might produce the following types:
ja_jp: アクションがコンテンツ入力に対して何を行うかによって、出力は次のタイプを生成する可能性があります。

source: Depending on whether a value was obtained, either return that value or a 404 response
ja_jp: 値が取得されたかどうかに応じて、その値を返すか、404 レスポンスを返すかのどちらかを選択します

source: Depending on which database you want to use, add the corresponding extension:
ja_jp: 使用したいデータベースに応じて、対応するエクステンションを追加します。

source: Depending on your database, include and configure exactly one xref:reactive-sql-clients.adoc[Reactive SQL client]. The following Reactive SQL clients are supported:
ja_jp: データベースに応じて、xref:reactive-sql-clients.adoc[Reactive SQL クライアント] を 1 つだけ含めて設定します。 次の Reactive SQL クライアントがサポートされています。

source: Depending on your developer API subscription level, some providers may enforce a rather strict request rate limiting policy.
ja_jp: 開発者 API サブスクリプションレベルによっては、一部のプロバイダーがかなり厳格なリクエストレート制限ポリシーを適用する場合があります。

source: Depends directly or indirectly on a CDI beans secured with a standard security annotation.
ja_jp: 標準のセキュリティーアノテーションで保護された CDI Bean に直接的または間接的に依存します。

source: Depends directly or indirectly on a `@RequestScoped` bean.
ja_jp: `@RequestScoped` Bean に直接的または間接的に依存します。

source: Deploy Vert.x Web, Servlet, or RESTEasy microservices as a Microsoft Azure Function.
ja_jp: Vert.x Web、Servlet、またはRESTEasyマイクロサービスをMicrosoft Azure Functionとしてデプロイします。

source: Deploy Verticles
ja_jp: Verticleのデプロイ

source: Deploy a Quarkus application to the Microsoft Azure cloud platform.
ja_jp: このガイドでは、QuarkusアプリケーションをMicrosoft Azure Cloudにデプロイする方法を説明します。

source: Deploy as container
ja_jp: コンテナーとしてデプロイ

source: Deploy as native application inside a container
ja_jp: コンテナー内にネイティブアプリケーションとしてデプロイ

source: Deploy client service to the Kubernetes cluster
ja_jp: Kubernetes クラスターへのクライアントサービスのデプロイ

source: Deploy on read-only environments
ja_jp: 読み取り専用環境へのデプロイ

source: Deploy our Quarkus application
ja_jp: Quarkusアプリケーションのデプロイ
